Repository: maykinmedia/django-log-outgoing-requests
Catalog: log_outgoing_requests/locale/*/LC_MESSAGES/django.po
Languages: nl

source: Extra
nl: Overig

source: Request body
nl: Request inhoud

source: Response body
nl: Response inhoud

source: Whether request logs should be saved to the database (default: {default}).
nl: Sla request logs op in de database (standaardconfiguratie: {default}).

source: Whether the body of the request and response should be logged (default: {default}).
nl: Sla request- en response-inhoud op in de database (standaardconfiguratie: {default}).

source: Outgoing request logs
nl: Uitgaande request-logs

source: Use default
nl: Gebruik standaardconfiguratie

source: Yes
nl: Ja

source: No
nl: Nee

source: The url of the outgoing request.
nl: De URL waar de request heen gestuurd is.

source: Hostname
nl: Hostnaam

source: The netloc/hostname part of the url.
nl: De hostnaam (inclusief poort) van de URL.

source: The parameters (if they exist).
nl: Eventuele parameters.

source: Status code
nl: HTTP-statuscode

source: The status code of the response.
nl: De statuscode van de response.

source: Method
nl: HTTP-methode

source: The type of request method.
nl: Het soort HTTP request.

source: The content type of the request.
nl: Het HTTP Content-Type van de request.

source: The request headers.
nl: De HTTP-headers van de request.

source: The encoding is either extracted from the Content-Type header or, if absent, taken from the default encoding configured for the content type. If the decoded request content is not displaying correctly, you may try changing the encoding value here.
nl: De encoding is afgeleid uit de Content-Type header, of, indien niet aanwezig, uit de standaardinstellingen for het content type. Indien de request-inhoud niet goed weergegeven wordt, dan kan je een andere encoding proberen.

source: The request body.
nl: De content/body van de request.

source: The content type of the response.
nl: Het HTTP Content-Type van de response.

source: The response headers.
nl: De HTTP-headers van de response.

source: The response body.
nl: De content/body van de response.

source: The encoding is either extracted from the Content-Type header or, if absent, taken from the default encoding configured for the content type. If the decoded response content is not displaying correctly, you may try changing the encoding value here.
nl: De encoding is afgeleid uit de Content-Type header, of, indien niet aanwezig, uit de standaardinstellingen for het content type. Indien de response-inhoud niet goed weergegeven wordt, dan kan je een andere encoding proberen.

source: Response in ms
nl: Duur in ms

source: This is the response time in ms.
nl: De tijd dat het duurde tussen versturen van de request en ontvangen van de response, in ms.

source: Timestamp
nl: Tijdstip

source: This is the date and time the API call was made.
nl: Tijdstip wanneer de request gemaakt is.

source: Trace
nl: Traceback

source: Text providing information in case of request failure.
nl: Technische traceback indien er een crash was.

source: Outgoing request log
nl: Uitgaand request logrecord

source: Response content length
nl: Response content grootte

source: Save logs to database
nl: Logs opslaan in de database

source: Save request + response body
nl: Sla de inhoud van request en/of response op in de database.

source: Maximal content size
nl: Maximale content-grootte

source: The maximal size of the request/response content (in bytes). If 'Require content length' is not checked, this setting has no effect.
nl: De maximale grootte van de request/response-inhoud (in bytes). Inhoud die deze grootte overschrijdt, dan wordt de inhoud niet opgeslagen.

source: Reset saving logs in database after
nl: Reset opslaan van logs in de database

source: If configured, after the config has been updated, reset the database logging after the specified number of minutes. Note: this overrides the LOG_OUTGOING_REQUESTS_RESET_DB_SAVE_AFTER environment variable. Additionally, depending on the broker that is used, if this duration is too long the key for the reset task might have expired before that time. So make sure not to set too large a value for the reset.
nl: Indien ingeschakeld zal, na het opslaan van de configuratie, het opslaan van logs in de database gereset worden na het gespecificeerde aantal minuten. Let op: dit heeft voorrang boven de environment variabele LOG_OUTGOING_REQUESTS_RESET_DB_SAVE_AFTER. Bovendien is het, afhankelijk van de broker die gebruikt wordt, mogelijk dat de key van de reset-taak al verlopen is voordat deze taak uitgevoerd is, dus kies een niet te grote waarde voor de reset.

source: Outgoing request log configuration
nl: Uitgaande request-logging configuratie
